Autodesk.Revit.DB.PropertyTableEntry.IsValidPropertyTableEntry(System.Double,System.Double,Autodesk.Revit.DB.PropertyTableEntryCurveType,System.Double,Autodesk.Revit.DB.PropertyTableEntryArcDirection)
Function used to check the input data is valid to create PropertyTableEntry object
distance:
The distance(start point to end point) of the PropertyTableEntry. The unit is feet.
bearing:
The angle of the PropertyTableEntry. The value should be in [0-2*PI]
curveType:
PropertyTableEntry type.
arcRadius:
If the curveType is Arc, this input the radius of the arc; It is not used if type is Line.
arcDir:
If the curveType is Arc, indicate the curve direction, either left or right. It is not used if type is Line.
Returns:
True if it is valid to create PropertyTableEntry; otherwise it is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.PropertyTableEntry.Create(System.Double,System.Double,Autodesk.Revit.DB.PropertyTableEntryCurveType,System.Double,Autodesk.Revit.DB.PropertyTableEntryArcDirection,System.Int32)
Creates a new PropertyTableEntry object.
Remarks:
If the input data is not valid, for example the distance is too short, or the raduis is samller than half distance.
an InvalidOperationException will be thrown.
distance:
The distance(start point to end point) of the PropertyTableEntry.
bearing:
The angle of the PropertyTableEntry. The value should be in [0-2*PI]
curveType:
The type of curve represented by this entry.
arcRadius:
If the curveType is Arc, this input the radius of the arc; It is not used if type is Line.
arcDir:
If the curveType is Arc, indicate the curve direction, either left or right. It is not used if type is Line.
id:
The id of the PropertyTableEntry.
Returns:
The new PropertyTableEntry object.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
PropertyTableEntry is invalid - it refers to either distance is too short.
Or for arc type, if the radius value is smaller than half the distance.
It will also be considered as invalid.
-or-
Failed to create new PropertyTable object.
Since:
2027

Autodesk.Revit.DB.PropertyTableEntry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PropertyTableEntry.ArcDirection
Represent the arc direction,
PT_Left means the arc appears to the left of the line segment.
Right means the arc appears to the right of the line segment.
Since:
2027

Autodesk.Revit.DB.PropertyTableEntry.CurveType
The curve type for this PropertyTableEntry
Since:
2027

Autodesk.Revit.DB.PropertyTableEntry.Id
Unique identifier for this PropertyTableEntry
Since:
2027

Autodesk.Revit.DB.PropertyTableEntry.Radius
The radius for arc type curve
The radius value must be greater than half the length of the line segment.
The larger the radius, the larger the circle becomes, resulting in a flatter arc.
Since:
2027

Autodesk.Revit.DB.PropertyTableEntry.Bearing
The bearing angle value of the PropertyTableEntry
Since:
2027

Autodesk.Revit.DB.PropertyTableEntry.Distance
The distance value of the PropertyTableEntry
Since:
2027

Autodesk.Revit.DB.PropertyTableEntry.#ctor(Autodesk.Revit.DB.PropertyTableEntry)
Constructs a new copy of the input PropertyTable object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.PropertyTableEntry
Represents a table row in a table-driven PropertyLine element.
Since:
2027